Repository: williamyangcn/BookmarkX
Catalog: Sources/BookmarkX/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# status.launching
source: Starting BookmarkX…
zh_hans: 正在启动 BookmarkX…

# status.failedTitle
source: Couldn’t start
zh_hans: 启动失败

# action.retry
source: Retry
zh_hans: 重试

# action.refresh
source: Refresh
zh_hans: 刷新

# action.refresh.help
source: Sync bookmarks from X (up to your batch size)
zh_hans: 从 X 同步书签（不超过设置的每次条数）

# sync.status.running
source: Syncing bookmarks…
zh_hans: 正在同步书签…

# enrichment.status.running
source: Organizing bookmarks…
zh_hans: 正在整理书签…

# enrichment.status.runningFormat
source: Organizing %lld of %lld…
zh_hans: 正在整理第 %lld / %lld 条…

# enrichment.status.completedFormat
source: Organized %lld bookmarks.
zh_hans: 已整理 %lld 条书签。

# enrichment.status.partialFormat
source: Organized %lld; %lld failed: %@
zh_hans: 已整理 %lld 条，失败 %lld 条：%@

# sync.status.signInRequired
source: Sign in with X to sync bookmarks.
zh_hans: 请先使用 X 账号登录后再同步书签。

# sync.status.completedFormat
source: Fetched %lld new, %lld updated, %lld restored, skipped %lld (target %lld new).
zh_hans: 新抓取 %lld，更新 %lld，恢复 %lld，跳过 %lld（目标新增 %lld）。

# action.cancel
source: Cancel
zh_hans: 取消

# bookmarks.syncedBadge
source: Synced
zh_hans: 已同步

# bookmarks.notSyncedBadge
source: Not synced
zh_hans: 未同步

# bookmarks.delete.title
source: Delete Bookmark
zh_hans: 删除书签

# bookmarks.delete.message
source: Local-only delete keeps it on X, so a later sync can bring it back. Delete on X removes it remotely too.
zh_hans: 仅删本地会保留 X 上的书签，之后同步还可再拉回；同时删 X 会一并移除远端书签。

# bookmarks.delete.local
source: Delete…
zh_hans: 删除…

# bookmarks.delete.localOnly
source: Delete Locally
zh_hans: 仅删除本地

# bookmarks.delete.localAndX
source: Delete Locally and on X
zh_hans: 删除本地并删除 X

# bookmarks.deletedLocal
source: Deleted locally. It can sync again if still bookmarked on X.
zh_hans: 已删除本地。若 X 上仍保留该书签，下次同步可再拉回。

# bookmarks.deletedLocalAndX
source: Deleted locally and on X.
zh_hans: 已删除本地与 X 上的书签。

# detail.syncStatus
source: Sync status
zh_hans: 同步状态

# sync.error.alreadyRunning
source: A sync is already running.
zh_hans: 同步正在进行中。

# sync.error.notConfigured
source: X account is not ready for sync. Sign in again.
zh_hans: X 账号尚未就绪，请重新登录后再同步。

# sync.error.invalidURL
source: Invalid X API URL.
zh_hans: X API 地址无效。

# sync.error.invalidResponse
source: Invalid response from X.
zh_hans: X 返回了无效响应。

# settings.sync
source: Bookmark Sync
zh_hans: 书签同步

# settings.sync.footer
source: Each refresh keeps paging past already-synced bookmarks until it imports up to the batch size of new ones (default 100), or there are no more on X. Deleting from X after sync is off by default.
zh_hans: 每次刷新会跳过已同步书签并继续向后翻页，直到新抓取满设定条数（默认 100），或 X 上没有更多。默认同步后不从 X 删除。

# settings.syncBatchSizeFormat
source: New bookmarks per refresh: %lld
zh_hans: 每次刷新新抓取：%lld 条

# settings.syncSkipAlreadySynced
source: Skip already-synced, then fetch older ones (recommended)
zh_hans: 跳过已同步，继续抓取更早的书签（推荐）

# settings.syncDeleteFromXAfterSync
source: Delete from X after syncing locally (off by default)
zh_hans: 同步到本地后从 X 删除（默认关闭）

# settings.syncNow
source: Sync Now
zh_hans: 立即同步

# action.addSample
source: Add Sample
zh_hans: 添加示例

# action.addSample.help
source: Insert a local sample bookmark for UI testing
zh_hans: 插入一条本地示例书签，便于测试界面

# action.saveNote
source: Save Note
zh_hans: 保存备注

# sidebar.library
source: Library
zh_hans: 书库

# sidebar.organize
source: Organize
zh_hans: 整理

# sidebar.allBookmarks
source: All Bookmarks
zh_hans: 全部书签

# sidebar.uncategorized
source: Uncategorized
zh_hans: 未分类

# sidebar.folders
source: Folders
zh_hans: 文件夹

# sidebar.tags
source: Tags
zh_hans: 标签

# sidebar.settings
source: Settings
zh_hans: 设置

# search.prompt
source: Search bookmarks
zh_hans: 搜索书签

# bookmarks.emptyTitle
source: No bookmarks yet
zh_hans: 还没有书签

# bookmarks.emptyDescription
source: Connect your X account in Settings, then refresh to sync bookmarks.
zh_hans: 在设置中连接 X 账号，然后点刷新同步书签。

# bookmarks.count %lld
source: %lld bookmarks
zh_hans: %lld 条书签

# detail.emptyTitle
source: Select a bookmark
zh_hans: 选择一条书签

# detail.emptyDescription
source: Select a bookmark from the list to view its preview, summary, and notes.
zh_hans: 从列表中选择一条书签，查看预览、摘要和备注。

# detail.title
source: Detail
zh_hans: 详情

# detail.summary
source: Summary
zh_hans: 摘要

# detail.category
source: Category
zh_hans: 分类

# detail.note
source: Note
zh_hans: 备注

# detail.bookmarkedAt
source: Bookmarked
zh_hans: 收藏时间

# detail.openOnX
source: Open on X
zh_hans: 在 X 打开

# folders.newPlaceholder
source: New folder name
zh_hans: 新文件夹名称

# folders.create
source: Create
zh_hans: 创建

# folders.emptyTitle
source: No folders
zh_hans: 暂无文件夹

# folders.emptyDescription
source: Create folders to organize bookmarks by topic.
zh_hans: 创建文件夹，按主题整理书签。

# tags.emptyTitle
source: No tags yet
zh_hans: 暂无标签

# tags.emptyDescription
source: Tags will appear here after Grok enrichment or manual tagging.
zh_hans: Grok 整理或手动打标后，标签会出现在这里。

# onboarding.subtitle
source: Turn your X bookmarks into a local, searchable knowledge base with Grok.
zh_hans: 用 Grok 把 X 书签变成可搜索的本地知识库。

# onboarding.step1.title
source: Sign in with X
zh_hans: 使用 X 账号登录

# onboarding.step1.detail
source: One login unlocks bookmark sync and your X Premium Grok quota.
zh_hans: 一次登录同时开通书签同步，并使用你的 X Premium Grok 额度。

# onboarding.step2.title
source: Use Grok
zh_hans: 使用 Grok

# onboarding.step2.detail
source: Default: X Premium quota after X login. Optional: xAI API Key or Auto fallback.
zh_hans: 默认：X 登录后使用 Premium 额度。可选：xAI API Key，或自动回退。

# onboarding.step3.title
source: Sync locally
zh_hans: 同步到本地

# onboarding.step3.detail
source: Everything is stored in SQLite on your Mac.
zh_hans: 全部数据保存在你 Mac 上的 SQLite 数据库中。

# onboarding.continueWithoutLogin
source: Continue without signing in
zh_hans: 暂不登录，稍后再说

# auth.signInWithX
source: Sign in with X
zh_hans: 使用 X 账号登录

# auth.signInWithX.headline
source: Sign in with your X account
zh_hans: 使用你的 X 账号登录

# auth.signInWithX.caption
source: No Client ID needed. Sign in with X to use Premium Grok quota and sync bookmarks.
zh_hans: 无需 Client ID。用 X 登录即可使用 Premium Grok 额度，并同步书签。

# auth.signedInBenefits
source: Connected for bookmark sync and X Premium Grok.
zh_hans: 已连接：可用于书签同步与 X Premium Grok。

# auth.xLogin
source: X Login
zh_hans: X 登录

# auth.xLogin.footer
source: BookmarkX uses official X OAuth. Enter your X Developer Client ID once under Advanced, then Sign in with X.
zh_hans: BookmarkX 使用官方 X OAuth。在「高级」中填写一次 Developer Client ID，然后点「使用 X 账号登录」。

# auth.xLogin.footer.session
source: Sign in with X in the browser window—no Developer Client ID required. Uses your X Premium Grok quota.
zh_hans: 在弹出窗口里用 X 账号登录即可，无需填写 Developer Client ID，直接使用你的 X Premium Grok 额度。

# auth.xLogin.footer.browser
source: Opens your default browser for X login so Google / Apple / passkeys work. Configure Client ID once under Advanced.
zh_hans: 会打开系统默认浏览器登录 X，Google / Apple / Passkey 都可用。Client ID 只需在高级设置里配置一次。

# auth.browserLogin.caption
source: Opens your default browser. Google login and passkeys work there. After authorizing, you’ll return to BookmarkX automatically.
zh_hans: 将打开系统默认浏览器登录；Google 与 Passkey 都可正常使用。授权后会自动回到 BookmarkX。

# auth.browserLogin.opening
source: Opening your browser… finish signing in there.
zh_hans: 正在打开浏览器，请在浏览器中完成登录…

# auth.clientID.onceHelp
source: One-time setup: create an X Native App, callback bookmarkx://oauth/x/callback, paste Client ID. Then every login uses your default browser.
zh_hans: 仅需配置一次：创建 X Native App，回调填 bookmarkx://oauth/x/callback，粘贴 Client ID。之后每次都在默认浏览器登录。

# auth.advancedOptional
source: Optional: xAI API Key
zh_hans: 可选：xAI API Key

# auth.advancedOptional.help
source: Only needed if you want API Key mode or Auto fallback. Default is X Premium after Sign in with X.
zh_hans: 仅在你要用 API Key 或自动回退时需要。默认是 X 登录后的 Premium 额度。

# auth.session.waiting
source: Sign in to X in the window… will continue automatically.
zh_hans: 请在窗口中登录 X，登录成功后会自动继续。

# auth.session.googleHint
source: Click “Continue with Google” — it stays inside BookmarkX so login cookies are saved. If Google blocks the page, use email/username instead.
zh_hans: 点「Continue with Google」会在 BookmarkX 内完成，以便保存登录会话。若 Google 提示不安全/无法登录，请改用邮箱或用户名。

# auth.session.popupTitle
source: Continue sign-in
zh_hans: 继续登录

# auth.session.popupOpened
source: Finish Google / Apple sign-in in the popup window…
zh_hans: 请在弹出的窗口里完成 Google / Apple 登录…

# auth.session.readyToContinue
source: X login detected. Continuing…
zh_hans: 已检测到 X 登录，正在继续…

# auth.session.continue
source: Continue
zh_hans: 继续

# auth.session.manualHint
source: If you already see your X home timeline, wait a moment or press Continue.
zh_hans: 如果已经看到 X 首页，请稍等，或点击「继续」。

# auth.session.openedSystemBrowser
source: Opened system browser for Google / Apple. After that, return here.
zh_hans: 已在系统浏览器打开 Google / Apple 登录，完成后请回到这里。

# auth.embeddedLogin
source: Use in-app login instead
zh_hans: 改用应用内登录

# auth.browserLogin.needsClientID
source: Use default browser instead (needs Client ID)
zh_hans: 改用默认浏览器登录（需 Client ID）

# auth.clientID.highlight
source: Paste the Client ID below, then click Sign in with X again.
zh_hans: 请先在下方粘贴 Client ID，再点「使用 X 账号登录」。

# auth.session.verifying
source: Verifying X session…
zh_hans: 正在验证 X 登录状态…

# auth.session.success
source: Signed in.
zh_hans: 登录成功。

# auth.session.missingCookies
source: Could not read the X login session. Please try again.
zh_hans: 无法读取 X 登录会话，请重试。

# auth.session.invalidResponse
source: X returned an invalid session response.
zh_hans: X 返回了无效的登录响应。

# auth.session.notSignedIn
source: Not signed in with X yet.
zh_hans: 尚未使用 X 登录。

# settings.grokFooter.premiumFirst
source: Default: use X Premium Grok after you sign in with X.
zh_hans: 默认：使用 X 登录后走 Premium Grok。

# auth.advancedX
source: Advanced: X Developer Client ID
zh_hans: 高级：X Developer Client ID

# auth.clientID.help
source: Create an X Developer app (Native App), set callback to bookmarkx://oauth/x/callback, then paste the Client ID here.
zh_hans: 在 X Developer 创建 Native App，回调填 bookmarkx://oauth/x/callback，然后把 Client ID 粘贴到这里。

# auth.clientID.required
source: Browser login needs a Client ID. Paste it below, or use in-app login (no Client ID).
zh_hans: 默认浏览器登录需要 Client ID。请先填写下方，或直接用应用内登录（无需 Client ID）。

# auth.editClientID
source: Edit Client ID
zh_hans: 修改 Client ID

# auth.banner.title
source: Sign in with X to sync bookmarks and use Premium Grok
zh_hans: 使用 X 登录以同步书签并使用 Premium Grok

# auth.banner.action
source: Open Settings
zh_hans: 打开设置

# onboarding.openSettings
source: Open Settings
zh_hans: 打开设置

# onboarding.continue
source: Continue
zh_hans: 继续

# settings.connections
source: Connections
zh_hans: 连接

# settings.xAccount
source: X account
zh_hans: X 账号

# settings.connectX
source: Connect X Account
zh_hans: 连接 X 账号

# settings.xCallbackURL
source: Callback URL
zh_hans: 回调地址

# settings.openDeveloperPortal
source: Open X Developer Portal
zh_hans: 打开 X 开发者平台

# settings.connectingX
source: Connecting…
zh_hans: 正在连接…

# settings.disconnectX
source: Disconnect X Account
zh_hans: 断开 X 账号

# settings.xOpeningBrowser
source: Opening X authorization…
zh_hans: 正在打开 X 授权页面…

# settings.xConnectedAsFormat
source: Connected as @%@
zh_hans: 已连接 @%@

# settings.xDisconnected
source: X account disconnected.
zh_hans: 已断开 X 账号。

# settings.grokAccessMode
source: Access mode
zh_hans: 接入模式

# settings.grokStatus
source: Status
zh_hans: 状态

# settings.grokFooter
source: X Premium uses your membership Grok quota after connecting X. API Key uses console.x.ai billing. Auto prefers Premium and falls back to API Key.
zh_hans: X Premium：连接 X 后使用会员 Grok 额度。API Key：使用 console.x.ai 账单。自动：优先 Premium，失败则回退 API Key。

# settings.openXAIConsole
source: Open xAI Console
zh_hans: 打开 xAI Console

# settings.testGrok
source: Test Grok
zh_hans: 测试 Grok

# settings.testingGrok
source: Testing…
zh_hans: 测试中…

# settings.grokTestSuccessFormat
source: Grok OK (%@) · %@ · %@
zh_hans: Grok 正常（%@）· %@ · %@

# grok.mode.xPremium.detail
source: Sign in with X to use your X Premium Grok quota.
zh_hans: 使用 X 登录后，直接使用 X Premium Grok 会员额度。

# grok.mode.apiKey.detail
source: Use an API Key from console.x.ai. This is billed separately from X Premium.
zh_hans: 使用 console.x.ai 的 API Key，与 X Premium 会员额度分开计费。

# grok.mode.auto
source: Auto
zh_hans: 自动

# grok.mode.auto.detail
source: Prefer X Premium when connected; otherwise use API Key.
zh_hans: 已连接 X 时优先用 Premium；否则使用 API Key。

# status.grokPremiumReady
source: X Premium Grok ready
zh_hans: X Premium Grok 已就绪

# status.grokPremiumMissing
source: Connect X for Premium Grok
zh_hans: 请先连接 X 以使用 Premium Grok

# status.grokAPIKeyReady
source: API Key ready
zh_hans: API Key 已就绪

# status.grokAPIKeyMissing
source: API Key missing
zh_hans: 未配置 API Key

# status.grokAutoPremium
source: Auto · Premium
zh_hans: 自动 · Premium

# status.grokAutoPremiumWithFallback
source: Auto · Premium + API fallback
zh_hans: 自动 · Premium + API 回退

# status.grokAutoAPIKey
source: Auto · API Key
zh_hans: 自动 · API Key

# status.grokAutoMissing
source: Auto needs X or API Key
zh_hans: 自动模式需要连接 X 或填写 API Key

# grok.error.premiumNotReady
source: Connect your X Premium account first.
zh_hans: 请先连接你的 X Premium 账号。

# grok.error.apiKeyMissing
source: Save an xAI API Key first.
zh_hans: 请先保存 xAI API Key。

# grok.error.autoNotReady
source: Connect X or save an API Key for Auto mode.
zh_hans: 自动模式请先连接 X，或保存 API Key。

# grok.error.premiumRequiresX
source: X Premium Grok requires a connected X account.
zh_hans: X Premium Grok 需要先连接 X 账号。

# grok.error.invalidResponse
source: Grok returned an invalid response.
zh_hans: Grok 返回了无效响应。

# grok.error.decodingFailed
source: Could not parse Grok enrichment JSON.
zh_hans: 无法解析 Grok 整理结果。

# grok.error.emptyContent
source: Grok returned empty content.
zh_hans: Grok 返回了空内容。

# grok.error.premiumRejectedFormat
source: X Premium Grok was rejected (%@). Switch to Auto or API Key, or reconnect X.
zh_hans: X Premium Grok 被拒绝（%@）。可切换到自动 / API Key，或重新连接 X。

# settings.saveGrokKey
source: Save Grok Key
zh_hans: 保存 Grok Key

# settings.grokSaved
source: Grok API key saved.
zh_hans: Grok API Key 已保存。

# settings.language
source: Language
zh_hans: 语言

# settings.interfaceLanguage
source: Interface language
zh_hans: 界面语言

# settings.aiOutputLanguage
source: AI output language
zh_hans: AI 输出语言

# settings.model
source: Model
zh_hans: 模型

# settings.grokModel
source: Grok model
zh_hans: Grok 模型

# settings.data
source: Data
zh_hans: 数据

# settings.localDatabase
source: Database
zh_hans: 数据库

# settings.localDatabaseValue
source: Local SQLite
zh_hans: 本地 SQLite

# settings.clearCredentials
source: Clear Stored Credentials
zh_hans: 清除已存凭证

# settings.credentialsCleared
source: Stored credentials were cleared.
zh_hans: 已清除已存凭证。

# status.xConnected
source: X connected
zh_hans: 已连接 X

# status.xDisconnected
source: X not connected
zh_hans: 未连接 X

# status.grokConfigured
source: Grok configured
zh_hans: 已配置 Grok

# status.grokMissing
source: Grok key missing
zh_hans: 未配置 Grok Key

# oauth.error.missingClientID
source: Enter the OAuth 2.0 Client ID from your X Developer app.
zh_hans: 请填写 X 开发者应用的 OAuth 2.0 Client ID。

# oauth.error.invalidURL
source: The X authorization URL is invalid.
zh_hans: X 授权地址无效。

# oauth.error.couldNotStart
source: Could not open the X authorization window.
zh_hans: 无法打开 X 授权窗口。

# oauth.error.cancelled
source: X authorization was cancelled.
zh_hans: 已取消 X 授权。

# oauth.error.invalidCallback
source: X returned an invalid authorization callback.
zh_hans: X 返回了无效的授权回调。

# oauth.error.deniedFormat
source: X authorization failed: %@
zh_hans: X 授权失败：%@

# oauth.error.stateMismatch
source: Authorization state validation failed. Please try again.
zh_hans: 授权状态校验失败，请重试。

# oauth.error.missingCode
source: X did not return an authorization code.
zh_hans: X 未返回授权码。

# oauth.error.invalidResponse
source: X returned an invalid network response.
zh_hans: X 返回了无效的网络响应。

# oauth.error.invalidToken
source: Could not read the X access token response.
zh_hans: 无法读取 X 访问令牌响应。

# oauth.error.invalidUser
source: Could not read the connected X account.
zh_hans: 无法读取已连接的 X 账号。

# language.system
source: System
zh_hans: 跟随系统

# language.simplifiedChinese
source: Simplified Chinese
zh_hans: 简体中文

# sidebar.inbox
source: Unread
zh_hans: 未读

# sidebar.unread
source: Unread
zh_hans: 未读

# sidebar.favorites
source: Favorites
zh_hans: 收藏

# sidebar.important
source: Important
zh_hans: 重要

# sidebar.archive
source: Archive
zh_hans: 归档

# sidebar.mailboxes
source: Bookmarks
zh_hans: 书签

# folders.newSection
source: New Folder
zh_hans: 新建文件夹

# importance.low
source: Low
zh_hans: 低

# importance.normal
source: Normal
zh_hans: 普通

# importance.high
source: High
zh_hans: 高

# bookmarks.filter.all
source: All
zh_hans: 全部

# bookmarks.filter.unread
source: Unread
zh_hans: 未读

# bookmarks.filter.others
source: Others
zh_hans: 其他

# bookmarks.filter.unreadFormat
source: Unread (%lld)
zh_hans: 未读（%lld）

# bookmarks.filter.othersFormat
source: Others (%lld)
zh_hans: 其他（%lld）

# bookmarks.section.today
source: Today
zh_hans: 今天

# bookmarks.section.yesterday
source: Yesterday
zh_hans: 昨天

# bookmarks.markRead
source: Mark as Read
zh_hans: 标为已读

# bookmarks.markUnread
source: Mark as Unread
zh_hans: 标为未读

# bookmarks.favorite
source: Add to Favorites
zh_hans: 加入收藏

# bookmarks.unfavorite
source: Remove from Favorites
zh_hans: 取消收藏

# bookmarks.importance
source: Importance
zh_hans: 重要程度

# bookmarks.archive
source: Archive
zh_hans: 归档

# bookmarks.unarchive
source: Move to Unread
zh_hans: 移回未读

# detail.showMetadata
source: Details
zh_hans: 详情

# detail.showPreview
source: Preview
zh_hans: 预览

# detail.previewFooter
source: X post
zh_hans: X 帖子

# detail.panelUnavailableTitle
source: Choose a view
zh_hans: 选择视图

# detail.panelUnavailableDescription
source: Select Unread or a folder to browse bookmarks.
zh_hans: 选择未读或文件夹以浏览书签。

# auth.session.finishPopup
source: Finish Google / Apple sign-in in the popup window…
zh_hans: 请在弹出的窗口里完成 Google / Apple 登录…

# auth.session.finishGoogle
source: Finish Google / Apple sign-in in this window…
zh_hans: 请在此窗口完成 Google / Apple 登录…

# auth.session.googleBlocked
source: Google blocked this embedded browser. Use email/username on the X login page instead.
zh_hans: Google 拦截了内嵌浏览器。请在 X 登录页改用邮箱或用户名登录。

# bookmarks.section.last7Days
source: Last 7 days
zh_hans: 7 天内

# bookmarks.section.last15Days
source: Last 15 days
zh_hans: 15 天内

# bookmarks.section.lastMonth
source: Last month
zh_hans: 1 个月内

# bookmarks.section.thisYear
source: This year
zh_hans: 今年

# bookmarks.section.lastYear
source: Last year
zh_hans: 去年
